package pre.sugar.kashicrawler.business;

import com.google.common.collect.Lists;
import com.google.common.collect.Maps;
import pre.sugar.kashicrawler.entity.WordFrequency;

import java.util.List;
import java.util.Map;

/**
 * Author: Xiao Tang
 * Date: 2022/6/20 22:42
 * Description: \
 */
public class WordFrequencyAnalysis {

    private static final int MIN_LENGTH = 2;
    private static final int MAX_LENGTH = 5;
    private static final int THRESHOLD = 5;

    /**
     * 单词频率分析器
     * @param content
     */
    public static Map<Integer, List<WordFrequency>> analysis(String content){
        content = content.replace(" ","");
        content = content.replace("\n","");
        Map<Integer, Map<String, Integer>> map = Maps.newHashMap();
        Map<Integer, List<WordFrequency>> wordFrequencyListMap = Maps.newHashMap();
        for (int i = MIN_LENGTH; i <= MAX_LENGTH; i++) {
            Map<String, Integer> wordFrequencyMap = Maps.newHashMap();
            map.put(i, wordFrequencyMap);
            for (int j = 0; j < content.length() - i; j++) {
                String word = content.substring(j, j + i);

                wordFrequencyMap.put(word, wordFrequencyMap.getOrDefault(word, 0) + 1);
            }
        }
        for (Integer wordLength : map.keySet()) {
            List<WordFrequency> wordFrequencyList = Lists.newArrayList();
            for (String word : map.get(wordLength).keySet()) {
                int frequency = map.get(wordLength).get(word);
                if (frequency <= THRESHOLD){
                    continue;
                }
                wordFrequencyList.add(new WordFrequency(word, frequency));
                wordFrequencyListMap.put(wordLength, wordFrequencyList);
            }
            wordFrequencyList.sort((o1, o2) -> o2.getFrequency() - o1.getFrequency());
        }
        return wordFrequencyListMap;
    }

    public static void print(Map<Integer, List<WordFrequency>> map){
        map.forEach((wordLength, wordFrequencyList) -> {
            System.out.print(wordLength + "=");
            System.out.println(wordFrequencyList);
            System.out.println();
        });
    }

    public static void main(String[] args){
//        String content = "AABCBABCBABCBABBCABAACCBAAAABCA";
        String content = "杨宛颖  23:29:51\n" +
                "靴紐が解けてる 木漏れ日は足を舐む\n" +
                "解开鞋带 让双脚沐浴在斑驳树荫下的阳光中\n" +
                "息を吸う音だけ聞こえてる\n" +
                "只有呼吸声在耳边轻抚\n" +
                "貴方は今立ち上がる 古びた椅子の上から\n" +
                "你突然从椅子上站了起来 从那把陈旧的椅子上\n" +
                "柔らかい麻の匂いがする\n" +
                "微风吹来了亚麻布淡淡的清香\n" +
                "\n" +
                "\n" +
                "遥か遠くへ まだ遠くへ\n" +
                "向着远方 遥远的远方\n" +
                "僕らは身体も脱ぎ去って\n" +
                "让灵魂脱出沉重的躯壳之外\n" +
                "まだ遠くへ 雲も越えてまだ向こうへ\n" +
                "向着那远方 穿过云海 追寻着彼方而去\n" +
                "風に乗って\n" +
                "乘着清风\n" +
                "僕の想像力という重力の向こうへ\n" +
                "任凭想象力像反方向的重力一样让我飘向天际\n" +
                "まだ遠くへ まだ遠くへ\n" +
                "向着远方 云端的远方\n" +
                "海の方へ\n" +
                "那片海所在的地方\n" +
                "\n" +
                "\n" +
                "靴紐が解けてる 蛇みたいに跳ね遊ぶ\n" +
                "松开的鞋带像蛇一样起舞 于是踢踏着鞋子玩耍\n" +
                "貴方の靴が気になる\n" +
                "我渐渐被你的鞋子吸引了视线\n" +
                "僕らは今歩き出す 潮風は肌を舐む\n" +
                "我们慢慢迈步向前 让海风亲吻着肌肤\n" +
                "手を引かれるままの道\n" +
                "在我们手牵着手的时候\n" +
                "\n" +
                "\n" +
                "さぁまだ遠くへ まだ遠くへ\n" +
                "来吧 向着远方 云端的远方\n" +
                "僕らはただの風になって\n" +
                "我们也化作一阵清风\n" +
                "まだ遠くへ 雲も越えてまだ向こうへ\n" +
                "向着那远方 穿过云海 吹向彼方\n" +
                "風に乗って 僕ら想像力という縛りを抜け出して\n" +
                "乘着清风 把贫瘠的想象力犹如束缚般甩在脑后\n" +
                "まだ遠くへ まだ遠くへ 海の方へ\n" +
                "向着远方 云端的远方 那片海所在的地方\n" +
                "\n" +
                "\n" +
                "靴紐が解けてる 僕はついにしゃがみ込む\n" +
                "直到鞋带松开 我才蹲下歇了一会\n" +
                "鳥の鳴く声だけ聞こえてる\n" +
                "只有鸟鸣在耳边萦绕\n" +
                "肩をそっと叩かれてようやく僕は気が付く\n" +
                "突然你轻拍我的肩膀 我抬起头才注意到\n" +
                "海がもう目の先にある\n" +
                "那片海就在眼前\n" +
                "\n" +
                "\n" +
                "あぁまだ遠くへ まだ遠くへ\n" +
                "啊 向着远方 大海的彼岸\n" +
                "僕らは心だけになって\n" +
                "我们已经褪去沉重的躯壳只剩心灵\n" +
                "まだ遠くへ 海も越えてまだ向こうへ\n" +
                "向着远方 越过大海 朝着未知的彼岸\n" +
                "風に乗って 僕の想像力という重力の向こうへ\n" +
                "乘着清风 像没有重力般飘向想象力的远方\n" +
                "まだ遠くへ まだ遠くへ\n" +
                "尽管还未抵达 云端的天际\n" +
                "海の方へ\n" +
                "大海的彼岸\n" +
                "\n" +
                "\n" +
                "僕らは今靴を脱ぐ さざなみは足を舐む\n" +
                "现在我们脱掉了鞋子光着脚 任凭水中的涟漪轻拭脚底\n" +
                "貴方の眼は遠くを見る\n" +
                "你仍然在眺望云端的远方\n" +
                "ライオンが戯れるアフリカの砂浜は\n" +
                "似乎在寻找着 在非洲的海岸嬉戏的狮子\n" +
                "海のずっと向こうにある\n" +
                "我想一切应该都在海的彼岸吧\n" +
                "\n" +
                "杨宛颖  23:30:19\n" +
                "水溜りに足を突っ込んで\n" +
                "踩在水洼中的你\n" +
                "貴方は大きなあくびをする\n" +
                "打了个大大的哈欠\n" +
                "酷い嵐を呼んで欲しいんだ\n" +
                "想要你唤来一阵风暴\n" +
                "この空も吹き飛ばすほどの\n" +
                "能将这片天空也一并带走\n" +
                "\n" +
                "風を待っていたんだ\n" +
                "我一直等待着风暴来临\n" +
                "何もない生活はきっと退屈過ぎるから\n" +
                "因为一无所有的生活定会无聊透顶\n" +
                "風を待っていたんだ\n" +
                "所以我一直等待着风暴降临\n" +
                "風を待っていたんだ\n" +
                "等待着风暴降临\n" +
                "\n" +
                "吹けば青嵐\n" +
                "肆虐吧 薰风\n" +
                "言葉も飛ばしてしまえ\n" +
                "将话语也带向远方\n" +
                "誰も何も言えぬほど\n" +
                "你我皆已哑然失语\n" +
                "僕らを呑み込んでゆけ\n" +
                "任凭风暴将我们吞噬\n" +
                "\n" +
                "どっどど　どどうど\n" +
                "呼！呼隆！哗哗！呼！\n" +
                "\n" +
                "風を呼ぶって本当なんだね\n" +
                "原来你真的能把风唤来啊\n" +
                "目を丸くした僕がそう聞いたから\n" +
                "我瞪大眼睛向你确认道\n" +
                "ぶっきらぼうに貴方は言った\n" +
                "你傲慢地回答我说\n" +
                "「何もかも思いのままだぜ」\n" +
                "那当然 一切都随我掌控\n" +
                "\n" +
                "風を待っていたんだ\n" +
                "我一直等待着风暴降临\n" +
                "型に合った社会は随分窮屈すぎるから\n" +
                "因为一成不变的社会实在是让人喘不过气来\n" +
                "それじゃもっと酷い雨を\n" +
                "既然这样 那就召来骤雨\n" +
                "この気分も飛ばす風を\n" +
                "唤来吹走心中阴霾的狂风吧\n" +
                "\n" +
                "吹けば青嵐\n" +
                "肆虐吧 薰风\n" +
                "何もかも捨ててしまえ\n" +
                "将一切都抛在脑后\n" +
                "今に僕らこのままじゃ\n" +
                "这样下去 过不了多久\n" +
                "誰かも忘れてしまう\n" +
                "我们甚至连自己是谁都会忘记\n" +
                "\n" +
                "青い胡桃も吹き飛ばせ\n" +
                "狂风吹落了青核桃\n" +
                "酸っぱいかりんも吹き飛ばせ\n" +
                "也吹下了酸木梨\n" +
                "もっと大きく　酷く大きく\n" +
                "还不够大 还不够大\n" +
                "この街を壊す風を\n" +
                "快唤来能将这条街道摧毁的狂风啊\n" +
                "\n" +
                "吹けよ青嵐\n" +
                "肆虐吧 薰风\n" +
                "何もかも捨ててしまえ\n" +
                "将一切都舍弃\n" +
                "悲しみも夢も全て飛ばしてゆけ、又三郎\n" +
                "悲伤也好 梦想也好 全部都给吹走吧 又三郎\n" +
                "\n" +
                "行けば永い道\n" +
                "道阻且长 行则将至\n" +
                "言葉が貴方の風だ\n" +
                "言语将化为薰风伴你左右\n" +
                "誰も何も言えぬほど\n" +
                "你我皆已哑然失语\n" +
                "僕らを呑み込んでゆけ\n" +
                "任凭风暴将我们吞噬\n" +
                "\n" +
                "どっどど　どどうど\n" +
                "呼！呼隆！哗哗！呼！\n" +
                "\n" +
                "淡い月に見とれてしまうから\n" +
                "看着淡淡月光不禁为之入迷\n" +
                "暗い足元も見えずに\n" +
                "故而连昏暗的前路亦无法看清\n" +
                "\n" +
                "転んだことに気がつけないまま\n" +
                "依然没有察觉到自己跌倒了\n" +
                "遠い夜の星が滲む\n" +
                "夜天裹遥远的星变得模糊一片\n" +
                "\n" +
                "したいことが見つけられないから\n" +
                "因为找不到想要去做的事\n" +
                "急いだ振り 俯くまま\n" +
                "所以装作赶急　却依然垂首低头\n" +
                "\n" +
                "転んだ後に笑われてるのも\n" +
                "就连在跌倒后被人嘲笑这事\n" +
                "気づかない振りをするのだ\n" +
                "亦装作没有察觉到\n" +
                "\n" +
                "形のない歌で朝を描いたまま\n" +
                "仍是以无形的歌声　去幻想着清晨\n" +
                "浅い浅い夏の向こうに\n" +
                "於那浅浅的　浅浅的　夏日的彼方\n" +
                "\n" +
                "冷たくない君の手のひらが見えた\n" +
                "我并不寒冷　因为能看见你的手心\n" +
                "淡い空 明けの蛍\n" +
                "淡色天空中　有着黎明的萤光\n" +
                "\n" +
                "自分がただの染みに見えるほど\n" +
                "自己看起来就不过似是一抹污痕\n" +
                "嫌いなものが増えたので\n" +
                "如此般讨厌的事物增加起来\n" +
                "\n" +
                "地球の裏側へ飛びたいのだ\n" +
                "故而我想要纵身飞往地球的另一面呢\n" +
                "無人の駅に届くまで\n" +
                "直至抵达无人的车站\n" +
                "\n" +
                "昨日の僕に出会うまで\n" +
                "直至与昨天的我相遇为止\n" +
                "\n" +
                "胸が痛いから下を向くたびに\n" +
                "我的内心痛苦得很啊　每当往下一看\n" +
                "君がまた遠くを征くんだ\n" +
                "你便又再远去了\n" +
                "\n" +
                "夢を見たい僕らを汚せ\n" +
                "想要做梦　将我们沾污吧\n" +
                "さらば 昨日夜に咲く火の花\n" +
                "再见了　於昨日夜裹盛放的火花\n" +
                "\n" +
                "水に映る花を 花を見ていた\n" +
                "看着水中映现出的花朵\n" +
                "\n" +
                "水に霞む月を 月を見ていたから\n" +
                "看着水中朦胧的月色\n" +
                "\n" +
                "夏が来ないままの空を描いたなら\n" +
                "若然幻想出那片夏日仍未到来的天空\n" +
                "君は僕を笑うだろうか\n" +
                "你大概会取笑我吧\n" +
                "\n" +
                "明け方の夢 浮かぶ月が見えた空\n" +
                "於拂晓之梦中　能看见那片浮月之空\n" +
                "\n" +
                "朝が来ないままで息が出来たなら\n" +
                "若然能永不迎来清晨　如此呼吸生存下去的话\n" +
                "遠い遠い夏の向こうへ\n" +
                "那就往遥远　遥远的　夏日的彼方去\n" +
                "\n" +
                "冷たくない君の手のひらが見えた\n" +
                "我并不寒冷　因为能看见你的手心\n" +
                "淡い朝焼けの夜空\n" +
                "遍染淡淡朝霞的夜空\n" +
                "\n" +
                "夏がこないままの街を今\n" +
                "此刻走於这夏日仍未到来的街道上\n" +
                "あぁ 藍の色 夜明けと蛍\n" +
                "啊啊　苍蓝之色　黎明与萤光" +
                "杨宛颖  23:36:34\n" +
                "最上階に君が一人\n" +
                "最上层的你一个人\n" +
                "揺れる影が　ずっと　ずっと ずっと\n" +
                "摇曳的身影 一直 一直 一直\n" +
                "「僕らの愛はもう見つかりはしないでしょう」\n" +
                "「我们的爱 已经再也找不到了吧」\n" +
                "\n" +
                "\n" +
                "透明エレジー\n" +
                "透明哀歌\n" +
                "\n" +
                "\n" +
                "言葉を飲み込む音　息を止めた\n" +
                "吞咽话语的声音 屏住呼吸\n" +
                "街中に一人\n" +
                "独自在街上\n" +
                "\n" +
                "\n" +
                "暮れた夜を混ぜては　喉の奥に　今\n" +
                "与日落后的夜色融合 在喉咙深处 现在\n" +
                "落としてゆく\n" +
                "开始坠落\n" +
                "\n" +
                "\n" +
                "昨日の事は忘れました\n" +
                "关于昨天的忘记了\n" +
                "明日の事も思い？出せ？なくて？\n" +
                "关于明天的也不能？想起？来？\n" +
                "\n" +
                "\n" +
                "あぁ　もう　痛い　痛いなんて\n" +
                "啊 已经很痛 疼痛什么的\n" +
                "声は　確かに届いてたんです\n" +
                "声音确实正在传递着\n" +
                "君が　「嫌い」 きらい なんて\n" +
                "讨厌你 讨厌什么的\n" +
                "言葉　錆（さび）付いて聞こえないや\n" +
                "话语沾上锈迹就听不到了呀\n" +
                "愛？　のない？　痛い容態\n" +
                "爱？不存在？疼痛的病情\n" +
                "唄も色も　まだ六十八夜の\n" +
                "歌曲和色彩 还有六十八夜的\n" +
                "そう、これでお別れなんだ\n" +
                "是啊 就此作别了吧\n" +
                "僕が　君に　送る\n" +
                "我送你离开\n" +
                "\n" +
                "\n" +
                "最上階から見た景色\n" +
                "从最上层看到的景色\n" +
                "落ちる影が　ずっと　ずっと ずっと\n" +
                "落下的影子 一直 一直 一直\n" +
                "「僕らの声も、もう聞こえてはいないでしょう？」\n" +
                "「我们的声音也是、能够听到的已经不存在了对吧？」\n" +
                "\n" +
                "\n" +
                "言葉の錆びてく音\n" +
                "言语正在生锈的声音\n" +
                "霧のかかる\n" +
                "蒙上雾气\n" +
                "心の奥底\n" +
                "心的深处\n" +
                "\n" +
                "\n" +
                "朝焼け色の中に 君は一人\n" +
                "在朝霞色之中 独你一人\n" +
                "また透けてくだけ\n" +
                "又一次变得透明\n" +
                "\n" +
                "\n" +
                "鼓動の音は一つ限り\n" +
                "鼓动之音只在一个\n" +
                "閉め切った部屋の中で響く\n" +
                "封闭的房间之中响起\n" +
                "\n" +
                "\n" +
                "言葉も出ない　出ないような\n" +
                "话语也 说不出 像说不出一样\n" +
                "僕は確かにここにいたんです\n" +
                "我确实就存在于此处\n" +
                "君を　見ない　見ないなんて\n" +
                "看不见你 看不见什么的\n" +
                "今も染み付いて離れないよ\n" +
                "如今也习惯了 不会离开了\n" +
                "\n" +
                "\n" +
                "もう痛い　痛い容態　耳の奥で　まだあの日の言葉が\n" +
                "已经很痛 疼痛的病情 耳朵深处依然残留着那天的话语\n" +
                "あぁこれでお別れなんて　そんな　君の声も\n" +
                "啊 这就是离别吧 你那样的声音依旧如此\n" +
                "ねぇ\n" +
                "呐\n" +
                "\n" +
                "\n" +
                "あの日願った言葉がもう\n" +
                "那一天祈求的言语已经\n" +
                "耳に染み込んじゃって\n" +
                "渗入耳中了\n" +
                "気持ちも切って\n" +
                "情绪也切断了\n" +
                "「バイバイバイ」\n" +
                "「拜拜拜」\n" +
                "何を欲しがったんだっけ？\n" +
                "其实是想要什么来着？\n" +
                "\n" +
                "\n" +
                "塵（ちり）も積もって　何年間\n" +
                "灰尘蓄积着的许多年\n" +
                "僕が　君が　僕が捨てちゃったんです\n" +
                "我 你 我已经舍弃了\n" +
                "まだ　あぁ\n" +
                "还有 啊啊\n" +
                "\n" +
                "\n" +
                "心の暗い暗い奥の\n" +
                "心中黑暗的 黑暗深处的\n" +
                "底にほんとは隠してたんです\n" +
                "在底下好好隐藏着的\n" +
                "今じゃ遅い　遅いなんて\n" +
                "现在已经太迟 太迟什么的\n" +
                "今更知っちゃったんだ\n" +
                "事到如今才明白了过来\n" +
                "\n" +
                "\n" +
                "あぁ　もう　嫌い　嫌いなんだ\n" +
                "啊 已经讨厌 讨厌着的啊\n" +
                "君も　僕も　全部　全部　全部\n" +
                "我和你也是 全部 全部 全部\n" +
                "「透けて消えてなくなって」\n" +
                "「透明了消失了变得不存在了」\n" +
                "\n" +
                "\n" +
                "言葉も出ない　出ないような\n" +
                "话语也 说不出 像说不出一样\n" +
                "声が確かに響いてたんです\n" +
                "声音确实正在传递着\n" +
                "今も嫌い　嫌いなんて\n" +
                "现在也是讨厌 讨厌之类的话语\n" +
                "言葉近すぎて聞こえないや\n" +
                "太过靠近 反而听不到了啊\n" +
                "\n" +
                "\n" +
                "もう痛い　痛い容態　唄も　色も まだ六十八夜の\n" +
                "已经很痛 疼痛的病情 歌曲和色彩 还有六十八夜的\n" +
                "そう　これでお別れなんだ\n" +
                "是啊 就此作别了吧\n" +
                "僕が　君に　送る\n" +
                "我送你离开\n" +
                "\n" +
                "\n" +
                "響く夜空に溶ける\n" +
                "回荡着 溶于夜空中\n" +
                "透明哀歌\n" +
                "透明哀歌\n" +
                "\n" +
                "杨宛颖  23:37:41\n" +
                "伝えたい事しかないのに\n" +
                "明明只有想要傳達的事情\n" +
                "何も声が出なくてごめんね\n" +
                "抱歉啊我卻什麽都說不出口\n" +
                "僕は毒虫になった\n" +
                "我變成了毒蟲\n" +
                "そんなに興味もないと思うけどさ\n" +
                "雖然我覺得你也沒什麽興趣\n" +
                "時間が惜しいので今度は\n" +
                "因為時間寶貴\n" +
                "手紙をしたためるとしようか\n" +
                "所以下次就寫信吧\n" +
                "不甲斐ない一日を\n" +
                "又是無用的一天\n" +
                "今日も始発の便に乗って\n" +
                "今天也搭上了頭班電車\n" +
                "始発とカフカ\n" +
                "首班車與卡夫卡\n" +
                "見返すには歩くしかないのに\n" +
                "明明要回顧的話只能繼續前行\n" +
                "上手く足が出なくてごめんね\n" +
                "抱歉啊我卻無法順利邁步\n" +
                "アベリアが咲いている\n" +
                "六道木正在綻放花朵\n" +
                "眼下の街を眺めている\n" +
                "眺望著眼前的街道\n" +
                "窓の桟の酷く小さな\n" +
                "將窗框中那無比微小的\n" +
                "羽虫を掬って押し潰した\n" +
                "白蟻取出來后碾死了\n" +
                "初夏の風に靡いた、　白花が今日も綺麗だった\n" +
                "在初夏的風中飄動的，　白花今日也如此美麗\n" +
                "教科書にさえ載っていない心情は\n" +
                "就連教科書也沒有記載的心情\n" +
                "今日が愛おしいようで\n" +
                "今天仿佛也無比令人憐愛\n" +
                "誰かがつまづいたって死んだふり\n" +
                "某個人只是跌倒了卻裝著死\n" +
                "僕らは　はらはら　はらはら\n" +
                "我們　飄飄蕩蕩　飄飄蕩蕩\n" +
                "心を知って征く\n" +
                "逐漸知曉內心\n" +
                "今更　ただ、ただ　ただただ\n" +
                "事到如今　只是，只是\n" +
                "花を摘まんでいる\n" +
                "只是只是採摘著花朵\n" +
                "あなたは　カラカラ　カラカラ\n" +
                "你　叮叮噹噹　叮叮噹噹\n" +
                "遠くを歩いて征く\n" +
                "逐漸走向遠方\n" +
                "震えた言葉で書くまま\n" +
                "用顫抖的話語書寫著\n" +
                "紙が終わっていく\n" +
                "紙張漸漸寫完\n" +
                "ある朝目覚めるとどうして\n" +
                "某個早晨睜開眼后不知為何\n" +
                "無駄に多い足が目を引いた\n" +
                "多到沒用的腿吸引了眼睛\n" +
                "毒虫になっていた\n" +
                "變成了毒蟲\n" +
                "そんなに興味もないと思えていた\n" +
                "一直覺得對此并沒什麼興趣\n" +
                "怯える家族もいないので\n" +
                "反正也沒有值得害怕的家人\n" +
                "一人凪の街を見下ろした\n" +
                "獨自一人俯視著風平浪靜的街道\n" +
                "初夏の風（かぜ）に、　靡いた貴方の髪が思い浮かんだ\n" +
                "回想起了，　你那在初夏的風中飄動的頭髮\n" +
                "きっと近い将来、貴方は人を嫌いになって\n" +
                "在不久的將來，你一定會討厭起人類\n" +
                "僕は人を失っていく\n" +
                "我也一定不再是人類\n" +
                "そうなら僕も笑って会えたのに\n" +
                "那樣的話明明我就能笑著見到你了\n" +
                "いつかは　カタカタ　カタカタ\n" +
                "總有一天會　喀噠喀噠　喀噠喀噠\n" +
                "一人を知っていく\n" +
                "逐漸知曉一個人\n" +
                "今更　はら　はら　はら　はら\n" +
                "事到如今　飄飄　蕩蕩　飄飄　蕩蕩\n" +
                "花を見上げている\n" +
                "仰望著花朵\n" +
                "あなたは　カナカナ　カナカナ\n" +
                "你　吱呀吱呀　吱呀吱呀\n" +
                "歌を歌って逝く\n" +
                "唱著歌逝去\n" +
                "震えた言葉で書くまま\n" +
                "用顫抖的話語書寫著\n" +
                "朝が終わっていく\n" +
                "早晨逐漸結束\n" +
                "あぁ、たぶん\n" +
                "啊啊，大概\n" +
                "たぶん僕がおかしいだけだろう\n" +
                "大概只是我不對勁了吧\n" +
                "人が虫になるわけもないし\n" +
                "人又不可能變成蟲子\n" +
                "手紙が着く当てだってないのに\n" +
                "而且信也不可能寄得到\n" +
                "あぁ、たぶん\n" +
                "啊啊，大概\n" +
                "たぶん夢を叶えるにもお金がいる\n" +
                "大概實現夢想也是需要花錢的吧\n" +
                "気付いてたけど\n" +
                "雖然已經注意到了\n" +
                "君から届いた手紙を\n" +
                "你所寄來的信\n" +
                "今も摘まんでいる\n" +
                "我如今仍然在採摘著\n" +
                "震えた何かの言葉を\n" +
                "只是一直注視著\n" +
                "ただ見つめている\n" +
                "顫抖著的某個話語\n" +
                "今更　はらはらはらはら\n" +
                "事到如今　飄飄蕩蕩　飄飄蕩蕩\n" +
                "心を知っていく\n" +
                "逐漸知曉內心\n" +
                "震えた言葉で書くまま\n" +
                "用顫抖的話語書寫著\n" +
                "僕らは\n" +
                "我們\n" +
                "僕らは　はらはら　はらはら\n" +
                "我們　飄飄蕩蕩　飄飄蕩蕩\n" +
                "心を知って征く\n" +
                "逐漸知曉內心\n" +
                "今更　ただ、ただ　ただただ\n" +
                "事到如今　只是，只是 只是只是\n" +
                "花を見上げている\n" +
                "仰望著花朵\n" +
                "あなたは　カナカナ　カナカナ\n" +
                "你　吱呀吱呀　吱呀吱呀\n" +
                "遠くを生きて征く\n" +
                "前往遠方生活\n" +
                "震えた言葉で書くまま\n" +
                "用顫抖的話語書寫著\n" +
                "朝が終わっていく\n" +
                "早晨逐漸結束\n" +
                "紙が終わっていく\n" +
                "紙張漸漸寫完\n" +
                "伝えたい事しかないのに\n" +
                "明明只有想要傳達的事情\n" +
                "何も声が出なくてごめんね\n" +
                "抱歉啊我卻什麽都說不出口\n" +
                "ただの毒虫になった\n" +
                "只不過是變成了毒蟲的\n" +
                "そんな僕の変な歌だ\n" +
                "這樣的我的奇怪的歌而已\n" +
                "\n" +
                "「雨の匂いに懐かしくなるのは何でなんでしょうか。\n" +
                "「对雨的味道感到很熟悉是为什么呢。\n" +
                "夏が近づくと胸が騒めくのは何でなんでしょうか。\n" +
                "夏天接近心中就会躁动是为什么呢。\n" +
                "人に笑われたら涙が出るのは何でなんでしょうか。\n" +
                "被人嘲笑眼泪会掉下来是为什么呢。\n" +
                "それでもいつか報われるからと思えばいいんでしょうか。 」\n" +
                "只要想着即使那样也总有一天会得到回报就可以了吗 。」\n" +
                "さよならって言葉でこんなに胸を裂いて\n" +
                "再见这句话这样让人撕心裂肺\n" +
                "今もたった数瞬の夕焼けに足が止まっていた\n" +
                "现在也在只有瞬间的晚霞前停下脚步\n" +
                "「先生、人生相談です。\n" +
                "「老师、我想谈谈人生。\n" +
                "この先どうなら楽ですか。\n" +
                "在这之后怎样才能感到轻松呢。\n" +
                "そんなの誰もわかりはしないよなんて言われますか。\n" +
                "会被说那种事情谁也不知道之类的吗。\n" +
                "ほら、苦しさなんて欲しいわけない。\n" +
                "看啊、并不是想要得到痛苦。\n" +
                "何もしないで生きていたい。\n" +
                "想要什么都不做地活下去。\n" +
                "青空だけが見たいのは我儘ですか。 」\n" +
                "只想看着蓝天是一种任性吗。」\n" +
                "「胸が痛んでも嘘がつけるのは何でなんでしょうか。\n" +
                "「即使心中很痛也要撒谎是为什么呢。\n" +
                "悪い人ばかりが得をしてるのは何でなんでしょうか。\n" +
                "总是坏人得到好处是为什么呢。\n" +
                "幸せの文字がお金を含むのは何でなんでしょうか。\n" +
                "幸字中包含￥是为什么呢。\n" +
                "一つ線を抜けば辛さになるのはわざとなんでしょうか。 」\n" +
                "去掉一条线就会变成辛是故意的吗。」\n" +
                "青春って値札が背中に貼られていて\n" +
                "后背被贴上了名为青春的标签\n" +
                "ヒッチコックみたいなサスペンスをどこか期待していた\n" +
                "内心某处期待着Hitchcock般的悬疑\n" +
                "「先生、どうでもいいんですよ。\n" +
                "「老师、怎样都可以了啊。\n" +
                "生きてるだけで痛いんですよ。\n" +
                "只是活着就很痛苦了啊。\n" +
                "ニーチェもフロイトもこの穴の埋め方は書かないんだ。\n" +
                "尼采和弗洛伊德都没有写填住这个洞口的方法啊。\n" +
                "ただ夏の匂いに目を瞑って、\n" +
                "只是在夏天的味道里闭上双眼、\n" +
                "雲の高さを指で描こう。\n" +
                "用手指描绘云的高度。\n" +
                "想い出だけが見たいのは我儘ですか。 」\n" +
                "只想看着回忆是一种任性吗。」\n" +
                "「ドラマチックに人が死ぬストーリーって売れるじゃないですか。\n" +
                "「人戏剧性死亡的故事不是很畅销吗。\n" +
                "花の散り際にすら値が付くのも嫌になりました。\n" +
                "对连花朵凋落都被贴上价格也感到讨厌了。\n" +
                "先生の夢は何だったんですか。\n" +
                "老师的梦想是什么呢。\n" +
                "大人になると忘れちゃうものなんですか。 」\n" +
                "是变成大人后就会忘记的东西吗。」\n" +
                "「先生、人生相談です。\n" +
                "「老师、我想谈谈人生。\n" +
                "この先どうなら楽ですか。\n" +
                "在这之后怎样才能感到轻松呢。\n" +
                "涙が人を強くするなんて全部詭弁でした。\n" +
                "眼泪会使人变强什么的都是诡辩。\n" +
                "あぁ、この先どうでもいいわけなくて、现実だけがちらついて、\n" +
                "啊啊、并不是在这之后怎样都好、只是现实飘忽不定、\n" +
                "夏が遠くて。\n" +
                "夏天渐渐远去。\n" +
                "これでも本当にいいんですか。\n" +
                "即使这样真的也可以吗。\n" +
                "このまま生きてもいいんですか。\n" +
                "这样活着也可以吗。\n" +
                "そんなの君にしかわからないよなんて言われますか。\n" +
                "会被说那种事情除了你没有人知道之类的吗。\n" +
                "ただ夏の匂いに目を瞑りたい。\n" +
                "只想在夏天的味道中闭上双眼。\n" +
                "いつまでも風に吹かれたい。\n" +
                "无论何时都想被风吹着。\n" +
                "青空だけが見たいのは我儘ですか。 」\n" +
                "只想看着蓝天是一种任性吗。」\n" +
                "あなただけを知りたいのは我儘ですか\n" +
                "只想知道你的事情是一种任性吗\n";
        Map<Integer, List<WordFrequency>> map = analysis(content);
        print(map);
    }
}
